# Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.
# Для n = 6: [2, 2, 2, 2, 2, 3] -> 13

n = int(input('Введите число N:' ))
m = []

print(f'Список: {[round((1+1/i)**i) for i in range(1, n+1)]}')
i = 1
sum = 0
while i <= n:
    sum += round((1+1/i)**i)
    i += 1
print(f'Сумма чисел списка: {sum}')